<!DOCTYPE html>
<html>
    <head>
        <title>Metodika pre otvorené údaje (opendata.gov.sk) : Národný projekt OpenData 2.0</title>
        <link rel="stylesheet" href="styles/site.css" type="text/css" />
        <META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    </head>

    <body class="theme-default aui-theme-default">
        <div id="page">
            <div id="main" class="aui-page-panel">
                <div id="main-header">
                    <div id="breadcrumb-section">
                        <ol id="breadcrumbs">
                            <li class="first">
                                <span><a href="index.html">Metodika pre otvorené údaje (opendata.gov.sk)</a></span>
                            </li>
                                                    <li>
                                <span><a href="120127509.html">Metodika pre sprístupňovanie otvorených údajov (opendata.gov.sk) Domov</a></span>
                            </li>
                                                    <li>
                                <span><a href="9.-Projekty_120128599.html">9. Projekty</a></span>
                            </li>
                                                </ol>
                    </div>
                    <h1 id="title-heading" class="pagetitle">
                                                <span id="title-text">
                            Metodika pre otvorené údaje (opendata.gov.sk) : Národný projekt OpenData 2.0
                        </span>
                    </h1>
                </div>

                <div id="content" class="view">
                    <div class="page-metadata">
                            
        
    
        
    
        
        
            Created by <span class='author'> miroslav.liska</span>, last modified by <span class='editor'> Markéta Šimoni</span> on aug 24, 2023
                        </div>
                    <div id="main-content" class="wiki-content group">
                    <h1 id="NárodnýprojektOpenData2.0-Čosúotvorenéúdaje?"><style>[data-colorid=ykfpax64da]{color:#212529} html[data-color-mode=dark] [data-colorid=ykfpax64da]{color:#d6dade}[data-colorid=gg12zcma27]{color:#212529} html[data-color-mode=dark] [data-colorid=gg12zcma27]{color:#d6dade}[data-colorid=k0foppvyhx]{color:#212529} html[data-color-mode=dark] [data-colorid=k0foppvyhx]{color:#d6dade}</style><strong><span data-colorid="gg12zcma27">Čo s&uacute; otvoren&eacute; &uacute;daje?</span></strong></h1><p><span data-colorid="k0foppvyhx">Otvoren&eacute; (vl&aacute;dne) d&aacute;ta s&uacute; inform&aacute;cie, ktor&eacute; zhromaždili, vytvorili alebo za ktor&eacute; zaplatili org&aacute;ny verejnej spr&aacute;vy (naz&yacute;vaj&uacute; sa tiež inform&aacute;cie verejn&eacute;ho sektora) a ktor&eacute; s&uacute; voľne dostupn&eacute; na opakovan&eacute; použitie na &uacute;čel v rozsahu priloženej licencie použitia.</span></p><p><span data-colorid="ykfpax64da">Otvoren&eacute; &uacute;daje patria do skupiny kľ&uacute;čov&yacute;ch &uacute;dajov verejnej spr&aacute;vy. &Uacute;daje ako ako napr. adresy, pr&aacute;vne subjekty, č&iacute;seln&iacute;ky, priestorov&eacute; &uacute;daje a in&eacute;, s&uacute; potrebn&eacute; takmer v každom informačnom syst&eacute;me verejnej spr&aacute;vy , akademick&eacute;ho, priv&aacute;tneho alebo neziskov&eacute;ho sektora. Preto je veľmi d&ocirc;ležit&eacute;, aby architekt&uacute;ra spr&iacute;stupňovania otvoren&yacute;ch &uacute;dajov bola čo najsyst&eacute;movej&scaron;ia mala jasne definovan&uacute; funkciu v egovernmente. Pr&iacute;nosy otvoren&yacute;ch d&aacute;t s&uacute; r&ocirc;znorod&eacute;, od zefekt&iacute;vnenia verejnej spr&aacute;vy cez hospod&aacute;rsky rast v s&uacute;kromnom sektore až po &scaron;ir&scaron;ie soci&aacute;lne blaho. Spoločnosť m&aacute; prospech z inform&aacute;ci&iacute;, ktor&eacute; s&uacute; transparentnej&scaron;ie a pr&iacute;stupnej&scaron;ie. Otvoren&yacute;mi d&aacute;tami sa posilňuje spolupr&aacute;ca, &uacute;časť a soci&aacute;lna inov&aacute;cia.</span></p><h1 id="NárodnýprojektOpenData2.0-Efektívnasprávaotvorenýchúdajovvoverejnejspráve"><strong>Efekt&iacute;vna spr&aacute;va otvoren&yacute;ch &uacute;dajov vo verejnej spr&aacute;ve</strong></h1><ul><li>Povinn&eacute; osoby s&uacute; povinn&eacute; spr&iacute;stupňovať otvoren&eacute; &uacute;daje podľa z&aacute;kona. Keďže verejn&aacute; spr&aacute;va spravuje veľk&eacute; množstvo tak&yacute;chto &uacute;dajov, najide&aacute;lnej&scaron;ie rie&scaron;enie je, aby jednotliv&eacute; informačn&eacute; syst&eacute;my verejnej spr&aacute;vy priamo poskytovali aplikačn&eacute; programov&eacute; rozhranie, ktor&eacute; poskytujn&uacute; vždy aktu&aacute;lne a d&ocirc;veryhodn&eacute; otvoren&eacute; &uacute;daje. Pre potreby ich objaviteľnosti, či strojovej spracovateľnosti je potrebn&eacute;&nbsp; vždy registrovať (skatalogizovať) jednotliv&eacute; zdroje otvoren&yacute;ch &uacute;dajov na centr&aacute;lnom mieste v tzv. N&aacute;rodnom katal&oacute;gu otvoren&yacute;ch &uacute;dajov (NKOD).</li><li>Čast&yacute;m rie&scaron;en&iacute;m spr&iacute;stupnenia otvoren&yacute;ch &uacute;dajov je aj tzv. lok&aacute;lny port&aacute;l s otvoren&yacute;mi &uacute;dajmi, ktor&yacute; si spravuje org&aacute;n verejnej moci s&aacute;m. Aj v tomto pr&iacute;pade je potrebn&eacute; dan&eacute; otvoren&eacute; &uacute;daje skatalogizovať v centr&aacute;lnom katal&oacute;gu NKOD.&nbsp;</li><li>Keďže nie v&scaron;etky informačn&eacute; syst&eacute;my poskytuj&uacute; aplikačn&eacute; programov&eacute; vybavenie pre spr&iacute;stupnenie otvoren&yacute;ch &uacute;dajov, v takto pr&iacute;pade je d&ocirc;ležit&eacute; katalogizovať aj otvoren&eacute; &uacute;daje ktor&eacute; existuj&uacute; len vo forme s&uacute;borov. Aj v tomto pr&iacute;pade je cieľom mať uložn&eacute; s&uacute;bory v prostred&iacute; org&aacute;nu verejnej moci (www str&aacute;nky OVM, verejn&eacute; &uacute;ložisko OVM) pričom vždy plat&iacute; povinnosť ich registrovať (katalogizovať) v centr&aacute;lnom port&aacute;li v NKODe.</li><li>Potenci&aacute;l využitia otvoren&yacute;ch &uacute;dajov je dan&yacute; aj kvalitou otvoren&yacute;ch &uacute;dajov, a preto je veľmi d&ocirc;ležit&eacute; t&uacute;to kvalitu merať, vyhodnocovať a prij&iacute;mať n&aacute;pravn&eacute; opatrenia aby sa dan&yacute; potenci&aacute;l mohol využiť.&nbsp;</li></ul><p>Z&aacute;kladom spr&aacute;vy otvoren&yacute;ch &uacute;dajov je teda centr&aacute;lny webov&yacute; port&aacute;l otvoren&yacute;ch &uacute;dajov obsahuj&uacute;ci tzv. N&aacute;rodn&yacute; katal&oacute;g otvoren&yacute;ch &uacute;dajov (NKOD). NKOD je zoznam dostupn&yacute;ch existuj&uacute;cich otvoren&yacute;ch &uacute;dajov (datasetov) spr&iacute;stupnen&yacute;ch r&ocirc;znymi poskytovateľmi a predstavuje hlavn&yacute; vyhľad&aacute;vač otvoren&yacute;ch &uacute;dajov pre človeka a pre stroj.&nbsp; V pr&iacute;pade že niektor&eacute; org&aacute;ny verejnej spr&aacute;vy maj&uacute; vlastn&yacute; port&aacute;l s otvoren&yacute;mi &uacute;dajmi je d&ocirc;lež&eacute;, aby doch&aacute;dzalo k automatizovanej katalogiz&aacute;cii dostupn&yacute;ch otvoren&yacute;ch &uacute;dajov do centr&aacute;lneho katal&oacute;gu NKOD. Kľ&uacute;čovou funkcionalitou centr&aacute;lneho port&aacute;lu otvoren&yacute;ch &uacute;dajov je aj funkcia merania kvality otvoren&yacute;ch &uacute;dajov, najm&auml; ich metad&aacute;t (popisn&yacute;ch d&aacute;t), tj. či s&uacute; spr&aacute;vne katalogizovan&eacute; (maj&uacute; licenciu, či s&uacute; d&aacute;ta dostupn&eacute; a podobne), pretože len vtedy sa daj&uacute; efekt&iacute;vne n&aacute;jsť a použiť.</p><h1 id="NárodnýprojektOpenData2.0-PredmetprojektuOD2.0"><strong>Predmet projektu OD2.0</strong></h1><h2 id="NárodnýprojektOpenData2.0-Súčasnériešenie(OD1.0)"><strong>S&uacute;časn&eacute; rie&scaron;enie (OD1.0)</strong></h2><p>S&uacute;časn&yacute; centr&aacute;lny port&aacute;l otvoren&yacute;ch &uacute;dajov data.gov.sk je zastaran&yacute; v oblasti softv&eacute;rovej architekt&uacute;ry, spr&aacute;vnosti formy katalogiz&aacute;cie otvoren&yacute;ch &uacute;dajov,&nbsp; a kedže je aj veľmi m&aacute;lo použ&iacute;van&yacute; a zn&aacute;my, množstvo skatalogizovan&yacute;ch zdrojov otvoren&yacute;ch d&aacute;t je v porovan&iacute; s EU veľmi n&iacute;zke (SR 2700 datasetov, ČR vy&scaron;e 145000). S&uacute;časn&yacute; port&aacute;l neposkytuje žiadnu podporu strojov&eacute;ho spracovania metad&aacute;t (katalogizačn&eacute; d&aacute;ta) ani automatizovan&eacute; vyhodnocovanie ich kvality.&nbsp; S&uacute;časn&eacute; nepodporuje funkciu automatizovanej katalogiz&aacute;cie s lok&aacute;lnych port&aacute;lov s otvoren&yacute;mi &uacute;dajmi.</p><h2 id="NárodnýprojektOpenData2.0-CieleprojektuOD2.0"><strong>Ciele projektu OD2.0</strong></h2><p>Hlavn&yacute; cieľ projektu OD2.0 je poskytovanie programov&eacute;ho vybavenia pre verejn&uacute; spr&aacute;vu, aby mohla plniť svoje z&aacute;konn&eacute; povinnosti v oblasti zverejňovanie otvoren&yacute;ch &uacute;dajov, a to efekt&iacute;vnym sp&ocirc;sobom v s&uacute;lade s aktu&aacute;lnymi &scaron;tandardmi, odpor&uacute;čaniami a trendmi spr&iacute;stupňovania otvoren&yacute;ch &uacute;dajov v Eur&oacute;pskej &Uacute;nii. Nov&yacute; port&aacute;l umožn&iacute; strojovo spracov&aacute;vať N&aacute;rodn&yacute; katal&oacute;g otvoren&yacute;ch &uacute;dajov (č&iacute;tanie, z&aacute;pis, anal&yacute;za, dotazovanie), pričom sa definuje jednotn&yacute; model metad&aacute;t otvoren&yacute;ch &uacute;dajov DCAT-AP-SK. Port&aacute;l s&uacute;časne bude poskytovať funkcionalitu automatizovanej katalogiz&aacute;cie extern&yacute;ch otvoren&yacute;ch &uacute;dajov a s&uacute;časne bude pravidelne vykon&aacute;vať meranie kvality zverejn&yacute;ch otvoren&yacute;ch &uacute;dajov. Vo v&yacute;sledku bude nov&yacute; port&aacute;l podobn&yacute; ako port&aacute;ly in&yacute;ch člensk&yacute;ch kraj&iacute;n EU, najm&auml; ako data.gov.uk, datos.gob.es, data.gov.cz a podobne.</p><p><br /></p><p /><ul class="childpages-macro"><li><a href="120128257.html" data-linked-resource-id="120128257" data-linked-resource-version="5" data-linked-resource-type="page">A) Port&aacute;l otvoren&yacute;ch &uacute;dajov 2.0</a></li><li><a href="120128009.html" data-linked-resource-id="120128009" data-linked-resource-version="3" data-linked-resource-type="page">B) Spr&iacute;stupňovanie zdrojov&yacute;ch k&oacute;dov informačn&yacute;ch syst&eacute;mov</a></li><li><a href="120128094.html" data-linked-resource-id="120128094" data-linked-resource-version="6" data-linked-resource-type="page">C) PoC Transformačn&eacute; a validačn&eacute; API pre otvoren&eacute; &uacute;daje</a></li></ul><p />
                    </div>

                    
                                                      
                </div>             </div> 
            <div id="footer" role="contentinfo">
                <section class="footer-body">
                    <p>Document generated by Confluence on okt 27, 2025 13:26</p>
                    <div id="footer-logo"><a href="http://www.atlassian.com/">Atlassian</a></div>
                </section>
            </div>
        </div>     </body>
</html>
